; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v8)
             (pred_8 ?v13 ?v6)
             (pred_2 ?v12 ?v6)
             (pred_11 ?v11 ?v12 )
	     (pred_10 ?v12)
             (pred_6 ?v9)
             (pred_1 ?v13)
             (pred_5 ?v6)
             (pred_12 ?v12)
             (pred_4 ?v13)
             (pred_7 ?v12)
             (pred_3 ))



(:action op_2
:parameters (?v2 ?v4 ?v7 ?v5)
:precondition (and (pred_6 ?v2) (pred_6 ?v4) (pred_1 ?v7) (pred_5 ?v5)
          (pred_9 ?v2 ?v4) (pred_8 ?v7 ?v5)
                   (pred_2 ?v4 ?v5) (pred_10 ?v2) 
                   (pred_12 ?v4) (pred_4 ?v7))
:effect (and  (pred_7 ?v4) (not (pred_12 ?v4))))


(:action op_5
:parameters (?v2 ?v10)
:precondition (and (pred_6 ?v2) (pred_6 ?v10)
               (pred_10 ?v2) (pred_9 ?v2 ?v10) (pred_7 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v2))))

(:action op_4
:parameters (?v2 ?v7)
:precondition (and (pred_6 ?v2) (pred_1 ?v7) 
                  (pred_10 ?v2) (pred_11 ?v7 ?v2) (pred_3 ))
:effect (and (pred_4 ?v7)
   (not (pred_11 ?v7 ?v2)) (not (pred_3 ))))


(:action op_3
:parameters (?v2 ?v3 ?v1)
:precondition (and (pred_6 ?v2) (pred_1 ?v3) (pred_1 ?v1)
                  (pred_10 ?v2) (pred_4 ?v1) (pred_11 ?v3 ?v2))
:effect (and (pred_4 ?v3) (pred_11 ?v1 ?v2)
        (not (pred_4 ?v1)) (not (pred_11 ?v3 ?v2))))

(:action op_1
:parameters (?v2 ?v7)
:precondition (and (pred_6 ?v2) (pred_1 ?v7) 
                  (pred_10 ?v2) (pred_4 ?v7))
:effect (and (pred_3 ) (pred_11 ?v7 ?v2) (not (pred_4 ?v7)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_10 obj_05 obj_19 obj_08 obj_12 obj_09 obj_06 obj_17 obj_01 obj_03 obj_21 obj_14 obj_15 obj_11 obj_16
    obj_13 obj_18 obj_04
    obj_20 obj_22 obj_07
    )

    (:init
       (pred_3)

       (pred_6 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_05)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_12)
       (pred_6 obj_09)
       (pred_6 obj_06)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_11)
       (pred_6 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_1 obj_20)
       (pred_1 obj_22)
       (pred_1 obj_07)

       (pred_9 obj_02 obj_08)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_19 obj_06)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_02)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_06 obj_19)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_17 obj_14)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_21 obj_16)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_17)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_03)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_16 obj_21)
       (pred_9 obj_16 obj_11)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_21)
       (pred_2  obj_11 obj_13)
       (pred_2  obj_10 obj_18)
       (pred_2  obj_21 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_05)
       (pred_7 obj_19)
       (pred_7 obj_08)
       (pred_7 obj_12)
       (pred_7 obj_09)
       (pred_7 obj_06)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_14)
       (pred_7 obj_15)
       (pred_7 obj_16)

       (pred_8  obj_20 obj_13)
       (pred_8  obj_22 obj_18)
       (pred_8  obj_07 obj_04)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_07 obj_15)
       (pred_10 obj_15)
    )

    (:goal (and
       (pred_11 obj_20 obj_15)
       (pred_11 obj_22 obj_17)
       (pred_11 obj_07 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_12)))
)
)

; plan
1. (op_5 obj_15 obj_01)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_01)
   goals met: 0 of 3
2. (op_4 obj_01 obj_20)
   deleted: (pred_11 obj_20 obj_01) (pred_3)
   added: (pred_4 obj_20)
   goals met: 0 of 3
3. (op_5 obj_01 obj_15)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_15)
   goals met: 0 of 3
4. (op_2 obj_15 obj_11 obj_20 obj_13)
   deleted: (pred_12 obj_11)
   added: (pred_7 obj_11)
   goals met: 0 of 3
5. (op_3 obj_15 obj_07 obj_20)
   deleted: (pred_4 obj_20) (pred_11 obj_07 obj_15)
   added: (pred_4 obj_07) (pred_11 obj_20 obj_15)
   goals met: 1 of 3
6. (op_5 obj_15 obj_11)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_11)
   goals met: 1 of 3
7. (op_5 obj_11 obj_03)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_03)
   goals met: 1 of 3
8. (op_5 obj_03 obj_09)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_09)
   goals met: 1 of 3
9. (op_5 obj_09 obj_05)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_05)
   goals met: 1 of 3
10. (op_3 obj_05 obj_22 obj_07)
   deleted: (pred_4 obj_07) (pred_11 obj_22 obj_05)
   added: (pred_4 obj_22) (pred_11 obj_07 obj_05)
   goals met: 2 of 3
11. (op_5 obj_05 obj_09)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_09)
   goals met: 2 of 3
12. (op_5 obj_09 obj_03)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_03)
   goals met: 2 of 3
13. (op_5 obj_03 obj_01)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_01)
   goals met: 2 of 3
14. (op_5 obj_01 obj_17)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_17)
   goals met: 2 of 3
15. (op_1 obj_17 obj_22)
   deleted: (pred_4 obj_22)
   added: (pred_3) (pred_11 obj_22 obj_17)
   goals met: 3 of 3
